OdIfcModelContext.setDefaultEntityColor(OdCmEntityColor!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Sets a new default model color.
\param color [in] An instance of the OdCmEntityColor object that represents the new default color.

OdIfcModelContext.getDefaultEntityColor
\details
Retrieves the current default model color.
\returns Returns an instance of the OdCmEntityColor object that contains the current default color for the model.

OdIfcModelContext.setDeviationParams(OdIfcDeviationParams)
\details
Sets new deviation parameters for the model context.
\param params [in] Deviation parameters to be set.

OdIfcModelContext.#ctor(OdIfcDeviationParams,OdCmEntityColor)
\details
Creates a new model context object with specified deviation parameters and color.
\param params [in] Deviation parameters.
\param color  [in] Default model color value.